Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: If you run `git status`, you can see your dirty state:
cs: Spustíte-li příkaz `git status`, uvidíte neuspořádaný stav svého projektu:

source: If you run a `git log` when your history looks like this, you’ll see two commits that have the same author date and message, which will be confusing.
cs: Pokud s takovouto historií spustíte příkaz `git log`, nastane zmatečná situace, kdy se zobrazí dvě revize se stejným datem autora i stejnou zprávou k revizi.

source: If you run a `git push` and your current branch is tracking `origin/master`, the commits listed by `git log origin/master..HEAD` are the commits that will be transferred to the server.
cs: Spustíte-li příkaz `git push` a vaše aktuální větev sleduje větev `origin/master`, budou na server přesunuty revize, které lze zobrazit příkazem `git log origin/master..HEAD`.

source: If you run a `log`, you see something like this:
cs: Po spuštění příkazu `log` by se zobrazilo následující:

source: If you run a mail client that can save several e-mails out in mbox format, you can save entire patch series into a file and then use `git am` to apply them one at a time.
cs: Jestliže spustíte poštovního klienta, který dokáže uložit několik e-mailů ve formátu mbox, můžete do jednoho souboru uložit celou sérii záplat a příkazem `git am` je pak aplikovat všechny najednou.

source: If you run it with no arguments, you get a simple listing of your current branches:
cs: Pokud ho spustíte bez dalších parametrů, získáte prostý výpis všech aktuálních větví:

source: If you run it with the `--full` option, it shows you all objects that aren’t pointed to by another object:
cs: Pokud příkaz spustíte s parametrem `--full`, zobrazí vám všechny objekty, na něž neukazuje žádný jiný objekt:

source: If you run that command before committing, you can tell if you’re about to commit whitespace issues that may annoy other developers.
cs: Spustíte-li tento příkaz před zapsáním revize, můžete se rozhodnout, zda chcete zapsat i problematické prázdné znaky, které mohou obtěžovat ostatní vývojáře.

source: If you run that, Git will page the entire output of all commands, no matter how long it is.
cs: Spustíte-li tento příkaz, Git nebude stránkovat celý výstup všech příkazů, bez ohledu na to, jak jsou dlouhé.

source: If you run this command directly after a clone, you should see something like this:
cs: Spustíte-li tento příkaz bezprostředně po klonování, objeví se zhruba následující:

source: If you run this command with a particular shortname, such as `origin`, you get something like this:
cs: Pokud použijete tento příkaz v kombinaci s konkrétním zkráceným názvem (např. `origin`), bude výstup vypadat zhruba následovně:

source: If you run this instead of setting up the `extMerge` and `extDiff` files, Git will use KDiff3 for merge resolution and the normal Git diff tool for diffs.
cs: Pokud spustíte tento příkaz místo nastavení souborů `extMerge` a `extDiff`, Git bude používat KDiff3 k řešení konfliktů při slučování a interní nástroj diff systému Git pro výpisy nástroje diff.

source: If you run this script, you’ll get content that looks something like this:
cs: Spustíte-li tento skript, získáte obsah v následující podobě:

source: If you run your `status` command, you once again see something like this:
cs: Po spuštění příkazu `status` se zobrazí zhruba toto:

source: If you run your status command again, you can see that your `README` file is now tracked and staged:
cs: Když nyní znovu provedete příkaz k výpisu stavů (git status), uvidíte, že je nyní soubor `README` sledován a připraven k zapsání:

source: If you set `help.autocorrect` to 1, Git will automatically run the command if it has only one match under this scenario.
cs: Nastavíte-li parametr `help.autocorrect` na hodnotu 1, Git automaticky spustí příkaz, který by v tomto dialogu vypsal, najde-li právě jediný takový.

source: If you set this as your 'git' user’s login shell, then the 'git' user can’t have normal shell access to your server.
cs: Pokud ho nastavíte jako přihlašovací shell uživatele 'git', pak nebude mít uživatel 'git' normální shellový přístup k vašemu serveru.

source: If you set this attribute on a file or set of files, then the next time you check out that branch, Git will replace that field with the SHA-1 of the blob.
cs: Pokud tento atribut nastavíte pro soubor nebo sadu souborů, při příštím checkoutu této větve Git nahradí toto pole kontrolním součtem SHA-1 blobu.

source: If you set this to the path of a file on your system, Git will use that file as the default message when you commit.
cs: Nastavíte-li tuto hodnotu na konkrétní umístění ve svém systému, Git použije tento soubor jako výchozí zprávu pro revize.

source: If you simply remove the file from your working directory, it shows up under the “Changes not staged for commit” (that is, _unstaged_) area of your `git status` output:
cs: Pokud soubor jednoduše odstraníte z pracovního adresáře, zobrazí se ve výpisu `git status` v části „Changes not staged for commit“ (tedy _nepřipraveno_:

source: If you specify `file://`, Git fires up the processes that it normally uses to transfer data over a network which is generally a lot less efficient method of transferring the data.
cs: Pokud zadáte výraz `file://`, Git spustí procesy, jež běžně používá k přenosu dat prostřednictvím sítě. Síť je většinou výrazně méně výkonnou metodou přenosu dat.

source: If you specify a directory or file name, you can limit the log output to commits that introduced a change to those files.
cs: Jestliže zadáte název adresáře nebo souboru, výstup logu tím omezíte na revize, které provedly změnu v těchto souborech.

source: If you stage one part of the file and leave another part unstaged, your status output will look like this:
cs: Připravíte-li k zapsání jednu část souboru a druhou nikoli, bude výstup příkazu status vypadat asi takto:

source: If you stash some work, leave it there for a while, and continue on the branch from which you stashed the work, you may have a problem reapplying the work.
cs: Jestliže odložíte část své práce, necháte ji určitou dobu v zásobníku a budete pokračovat ve větvi, z níž jste práci odložili, můžete mít problémy s opětovnou aplikací odkladu.

source: If you tell the script that it was, it stages the file to mark it as resolved for you.
cs: Pokud skriptu oznámíte, že ano, připraví soubor k zapsání a tím ho označí jako vyřešený.

source: If you track down a bug in your code and want to know when it was introduced and why, file annotation is often your best tool.
cs: Zjistíte-li ve svém zdrojovém kódu chybu a chcete vědět, kdy a jak vznikla, je často nejlepším nástrojem anotace souboru (file annotation).

source: If you treat rebasing as a way to clean up and work with commits before you push them, and if you only rebase commits that have never been available publicly, then you’ll be fine.
cs: Budete-li používat přeskládání jako metodu vyčištění a práce s revizemi předtím, než je odešlete, a budete-li přeskládávat pouze revize, které dosud nikdy nebyly zveřejněny, nemusíte se žádných problémů obávat.

source: If you try to check out that object again at some point, you’ll always get the data of the first object.
cs: Pokud se někdy v budoucnosti pokusíte znovu provést checkout tohoto objektu, vždy dostanete data prvního objektu.

source: If you try to merge two branches and subsequently have merge conflicts, you can run the command `git mergetool`; it starts P4Merge to let you resolve the conflicts through that GUI tool.
cs: Jestliže se pokusíte sloučit dvě větve a dojde při tom ke konfliktu, můžete spustit příkaz `git mergetool`. Příkaz spustí program P4Merge, v němž budete moci v grafickém uživatelském rozhraní konflikt vyřešit.

source: If you try to switch back to a branch where those files are still in the actual tree rather than a submodule — you get this error:
cs: Pokud se pokusíte přepnout zpět do větve, kde jsou tyto soubory v aktuálním stromu, a ne v submodulu, zobrazí se tato chyba:

source: If you try, you’ll see a login rejection like this:
cs: Pokud to zkusíte, zobrazí se zamítnutí přihlášení:

source: If you type `2` or `u` at the `What now>` prompt, the script prompts you for which files you want to stage:
cs: Zadáte-li na výzvu `What now>` (Co teď) odpověď `2` nebo `u`, skript se vás zeptá, které soubory chcete připravit k zapsání:

source: If you type `gitk` on the command line in your project, you should see something like Figure 2-2.
cs: Pokud do příkazového řádku ve svém projektu zadáte příkaz `gitk`, otevře se okno podobné jako na obrázku 2-2.

source: If you update a reference, Git doesn’t edit this file but instead writes a new file to `refs/heads`.
cs: Pokud některou referenci aktualizujete, Git nebude tento soubor upravovat, ale zapíše nový soubor do adresáře `refs/heads`.

source: If you use the ACL structure returned from the `get_acl_access_data` method and check it against the listed files in each of the commits, you can determine whether the user has access to push all of their commits:
cs: Jestliže používáte strukturu ACL získanou metodou `get_acl_access_data` a kontrolujete ji proti seznamu souborů v každé revizi, můžete určit, zda bude mít uživatel oprávnění odesílat všechny své revize:

source: If you use the Bash shell, Git comes with a nice auto-completion script you can enable.
cs: Jestliže používáte shell Bash, nabízí vám Git možnost zapnout si skript pro automatické dokončování.

source: If you visit the "Plans and pricing" page at `https://github.com/pricing` and click the "Sign Up" button on the Free account (see Figure 4-2), you’re taken to the signup page.
cs: Jestliže na stránce „Pricing and Signup“ (`https://github.com/pricing`) kliknete u bezplatného účtu (Free) na tlačítko „Sign Up“ (viz obrázek 4-2), přejdete na registrační stránku.

source: If you want Git instead to pull down only the `master` branch each time, and not every other branch on the remote server, you can change the fetch line to
cs: Pokud ale raději chcete, aby Git pokaždé stáhl pouze větev `master` a nestahoval žádné jiné větve na vzdáleném serveru, změňte řádek příkazu fetch na:

source: If you want Git to check object consistency on every push, you can force it to do so by setting `receive.fsckObjects` to true:
cs: Pokud chcete, aby Git kontroloval konzistenci objektů při každém odeslání dat, můžete mu to zadat nastavením možnosti `receive.fsckObjects` na hodnotu true:

source: If you want Git to try a bit more intelligently to resolve the conflict, you can pass a `-3` option to it, which makes Git attempt a three-way merge.
cs: Pokud chcete, aby se Git pokusil vyřešit konflikt inteligentněji, můžete zadat parametr `-3`. Git se pokusí o třícestné sloučení.

source: If you want John to have only read access to this project, you can do this instead:
cs: Pokud chcete, aby měl John u projektu pouze oprávnění pro čtení, můžete provést následující:

source: If you want an `opera` branch that you can work on separately, you can run
cs: Chcete-li používat větev `opera`, v níž můžete pracovat odděleně, spusťte příkaz:

source: If you want an attribute like bold in the previous example, you can choose from `bold`, `dim`, `ul`, `blink`, and `reverse`.
cs: Pokud chcete použít atribut, jakým bylo v předchozím příkladu například tučné písmo, můžete vybírat mezi `bold` (tučné), `dim` (tlumené), `ul` (podtržené), `blink` (blikající) a `reverse` (obrácené).

source: If you want an easier way to test the stashed changes again, you can run `git stash branch`, which creates a new branch for you, checks out the commit you were on when you stashed your work, reapplies your work there, and then drops the stash if it applies successfully:
cs: Pokud byste uvítali jednodušší způsob, jak znovu otestovat odložené změny, můžete spustit příkaz `git stash branch`, který vytvoří novou větev, stáhne do ní revizi, na níž jste se nacházeli při odložení práce, a aplikuje na ni vaši práci. Proběhne-li aplikace úspěšně, Git odklad odstraní:

source: If you want more complex access control type permissions on your repositories, you can handle them with the normal filesystem permissions of the operating system your server runs.
cs: Pokud chcete pro své repozitáře nastavit komplexnější správu oprávnění, můžete je opatřit běžnými oprávněními k systému souborů, které vám nabízí operační systém daného serveru.

source: If you want some repositories to be read-only to certain users and read/write to others, access and permissions can be a bit difficult to arrange.
cs: Pokud chcete, aby byly určité repozitáře pro některé uživatele pouze ke čtení a pro jiné i k zápisu, může být nastavení přístupu a oprávnění poměrně náročné.

source: If you want the history, you can accomplish that as quickly as you can pull the data out of the Subversion server (which may take a while).
cs: Server Subversion můžete úplně přestat používat. Chcete-li získat historii projektu, dostanete ji tak rychle, jak jen dovedete stáhnout data ze serveru Subversion (což ovšem může chvíli trvat).

source: If you want to allow Git protocol access for the `iphone_project`, you add this to the end of the `gitosis.conf` file:
cs: Chcete-li povolit přístup přes protokol Git k projektu `iphone_project`, přidejte ho na konec souboru `gitosis.conf`:

source: If you want to allow anonymous read-only access to your projects, you’ll have to set up SSH for you to push over but something else for others to pull over.
cs: Pokud chcete povolit anonymní přístup pro čtení k vašim projektům, budete muset nastavit protokol SSH k odesílání svých dat, ale musíte přidat i jiný protokol, který budou ostatní používat pro stahování.

source: If you want to always fetch the master and experiment branches, add two lines:
cs: Chcete-li pokaždé vyzvednout hlavní větev a větev „experiment“, vložte do něj tyto dva řádky:

source: If you want to apply one of the older stashes, you can specify it by naming it, like this: `git stash apply stash@{2}`.
cs: Chcete-li aplikovat některý ze starších odkladů, můžete ho určit na základě jeho označení, např. `git stash apply stash@{2}`.

source: If you want to back up or clone your repository, copying this single directory elsewhere gives you nearly everything you need.
cs: Chcete-li zazálohovat nebo naklonovat repozitář, zkopírování tohoto jediného adresáře do jiného umístění vám poskytne prakticky vše, co budete potřebovat.

source: If you want to be more specific about which commands are colored and how, Git provides verb-specific coloring settings.
cs: Pokud byste rádi nastavili přesněji jak budou zvýrazněny různé příkazy nebo máte starší verzi, nabízí Git nastavení barev pro jednotlivé příkazy.

source: If you want to check out what GitWeb would look like for your project, Git comes with a command to fire up a temporary instance if you have a lightweight server on your system like `lighttpd` or `webrick`.
cs: Pokud vás zajímá, jak by GitWeb vypadal pro váš projekt, nabízí Git příkaz, jímž lze spustit dočasnou instanci. V systému je třeba mít lehký server typu `lighttpd` nebo `webrick`.

source: If you want to check your settings, you can use the `git config --list` command to list all the settings Git can find at that point:
cs: Chcete-li zkontrolovat vaše nastavení, použijte příkaz `git config --list`. Git vypíše všechna aktuálně dostupná nastavení:

source: If you want to clone the repository into a directory named something other than grit, you can specify that as the next command-line option:
cs: Pokud chcete naklonovat repozitář do adresáře pojmenovaného jinak než grit, můžete název zadat jako další parametr na příkazovém řádku:

source: If you want to contribute to an existing project to which you don’t have push access, GitHub encourages forking the project.
cs: Chcete-li přispět do existujícího projektu, k němuž nemáte oprávnění pro odesílání, umožňuje GitHub rozštěpení projektu.

source: If you want to copy these examples, you’ll have to make a writeable copy of my test repository.
cs: Chcete-li si tyto příklady zkopírovat, budete si muset obstarat zapisovatelnou kopii mého testovacího repozitáře.

source: If you want to delete your `serverfix` branch from the server, you run the following:
cs: Chcete-li ze serveru odstranit větev `serverfix`, můžete to provést takto:

source: If you want to do something one time, you can specify the refspec on the command line, too.
cs: Chcete-li nějakou akci provést pouze jednou, můžete použít refspec také na příkazovém řádku.

source: If you want to get a copy of an existing Git repository — for example, a project you’d like to contribute to — the command you need is `git clone`.
cs: Chcete-li vytvořit kopii existujícího repozitáře Git (například u projektu, do nějž chcete začít přispívat), pak příkazem, který hledáte, je `git clone`.

source: If you want to install Git on Linux via a binary installer, you can generally do so through the basic package-management tool that comes with your distribution.
cs: Chcete-li nainstalovat Git v Linuxu pomocí binárního instalátoru, většinou tak můžete učinit pomocí základního nástroje pro správu balíčků, který je součástí vaší distribuce.

source: If you want to make the `trunk` subdirectory be the new project root for every commit, `filter-branch` can help you do that, too:
cs: Chcete-li udělat z podadresáře `trunk` nový kořenový adresář projektu pro všechny revize, i s tím vám pomůže příkaz `filter-branch`:

source: If you want to map this to better Git author data, you need a mapping from the Subversion users to the Git authors.
cs: Jestliže vyžadujete podrobnější informace ve stylu systému Git, budete potřebovat mapování z uživatelů Subversion na autory Git.

source: If you want to override this with a different name or e-mail address for specific projects, you can run the command without the `--global` option when you’re in that project.
cs: Pokud chcete pro konkrétní projekt uživatelské jméno nebo e-mailovou adresu změnit (přebít), můžete příkaz spustit bez parametru `--global`. V takovém případě je nutné, abyste se nacházeli v adresáři daného projektu.

source: If you want to place your repositories on a server that doesn’t have accounts for everyone on your team whom you want to have write access, then you must set up SSH access for them.
cs: Pokud chcete své repozitáře umístit na server, jenž nemá účty pro všechny členy vašeho týmu, kteří by měli mít oprávnění k zápisu, musíte pro ně nastavit SSH přístup.

source: If you want to pull commit `e43a6` into your master branch, you can run
cs: Chcete-li do hlavní větve natáhnout revizi `e43a6`, můžete zadat následující příkaz:

source: If you want to push from your laptop when you’re at home, you have to mount the remote disk, which can be difficult and slow compared to network-based access.
cs: Budete-li chtít pracovat doma a odeslat data z notebooku, budete muset připojit vzdálený disk, což může být ve srovnání s přístupem prostřednictvím sítě složité a pomalé.

source: If you want to push to both a Git server and a Subversion server, you have to push (`dcommit`) to the Subversion server first, because that action changes your commit data.
cs: Chcete-li revize odeslat jak na server Git, tak na server Subversion, odešlete je nejprve na server Subversion (`dcommit`), protože tím změníte data revizí.

source: If you want to push your master branch to your `origin` server (again, cloning generally sets up both of those names for you automatically), then you can run this to push your work back up to the server:
cs: Pokud chcete poslat svou hlavní větev na server `origin` (i tady platí, že proces klonování vám nastaví názvy `master` i `origin` automaticky), můžete k odeslání své práce na server použít tento příkaz:

source: If you want to remove a reference for some reason — you’ve moved the server or are no longer using a particular mirror, or perhaps a contributor isn’t contributing anymore — you can use `git remote rm`:
cs: Chcete-li, ať už z jakéhokoli důvodu, odstranit referenci (přesunuli jste například server nebo už nepoužíváte dané zrcadlo, nebo třeba přispěvatel přestal přispívat), můžete využít příkaz `git remote rm`:

source: If you want to remove all accidentally committed editor backup files, you can run something like `git filter-branch --tree-filter "rm -f *~" HEAD`.
cs: Chcete-li odstranit všechny nedopatřením zapsané záložní soubory editoru, můžete spustit zhruba toto: `git filter-branch --tree-filter "rm -f *~" HEAD`.

source: If you want to remove the "added cat-file" commit and change the order in which the other two commits are introduced, you can change the rebase script from this
cs: Budete-li chtít odstranit revizi „added cat-file“ a současně změnit pořadí, v němž se vyskytují zbývající dvě revize, změňte skript přeskládání z podoby:

source: If you want to rename a file in Git, you can run something like
cs: Chcete-li v systému Git přejmenovat soubor, můžete spustit třeba příkaz

source: If you want to rename a reference, in newer versions of Git you can run `git remote rename` to change a remote’s shortname.
cs: Chcete-li změnit zkrácené jméno vzdáleného repozitáře, můžete v novějších verzích systému Git spustit příkaz `git remote rename`.

source: If you want to run the web interface on a server all the time for your team or for an open source project you’re hosting, you’ll need to set up the CGI script to be served by your normal web server.
cs: Chcete-li trvale spustit webové rozhraní na serveru pro svůj tým nebo nebo pro open-source projekt, který hostujete, musíte nastavit CGI skript tak, aby byl obsluhován vaším běžným webovým serverem.

source: If you want to see a list of all the options your version of Git recognizes, you can run
cs: Pokud vás zajímá seznam parametrů, které vaše verze systému Git rozeznává, můžete si nechat jejich seznam vypsat příkazem:

source: If you want to see more information about a particular remote, you can use the `git remote show [remote-name]` command.
cs: Jestliže chcete získat více informací o konkrétním vzdáleném repozitáři, můžete použít příkaz `git remote show [název vzdáleného repozitáře]`.

source: If you want to see the changes introduced between the current version of a file and the file a month ago, Git can look up the file a month ago and do a local difference calculation, instead of having to either ask a remote server to do it or pull an older version of the file from the remote server to do it locally.
cs: Pokud si chcete prohlédnout změny provedené mezi aktuální verzí souboru a týmž souborem před měsícem, Git vyhledá měsíc starý soubor a provede lokální výpočet rozdílů, aniž by o to musel žádat vzdálený server nebo stahovat starší verzi souboru ze vzdáleného serveru a poté provádět lokální výpočet.

source: If you want to see the fifth prior value of the HEAD of your repository, you can use the `@{n}` reference that you see in the reflog output:
cs: Chcete-li zobrazit pátou poslední hodnotu ukazatele HEAD svého repozitáře, použijte referenci `@{n}` z výstupu reflog:

source: If you want to see what is in `master` or `experiment` but not any common references, you can run
cs: Chcete-li zjistit, co je ve větvi `master` nebo `experiment`, ale nechcete vidět jejich společné reference, zadejte příkaz:

source: If you want to see what you’ve staged that will go into your next commit, you can use `git diff --cached`.
cs: Chcete-li vidět, co jste připravili a co bude součástí příští revize, použijte příkaz `git diff --cached`.

source: If you want to see which files are unmerged at any point after a merge conflict, you can run `git status`:
cs: Chcete-li kdykoli po konfliktu zjistit, které soubory zůstaly nesloučeny, spusťte příkaz `git status`:
